
################################################################
##    БИБЛИОТЕКА ГЕНЕРАТИВНОГО ПРЕДОБУЧЕННОГО ПРЕОБРАЗОВАНИЯ
## 
##      Generative pre-trained transformer (GPT library)
## 
## Версия:   0.1
## Дата:     2026-01-30
## Автор:    github.com/Balans097
################################################################


# 0.1 — начальная реализация библиотеки (2026-01-30)




# nim c -d:release libGPT.nim




import math, os, osproc, random, sequtils, strutils
import src/[attention, generation, layers, loss, 
            model, tokenization, training, utils]





################################################################
####################### ИСХОДНЫЕ ДАННЫЕ ########################
################################################################
const
    FN = "Файл.txt"

let
    A = 77

var
    s = 3.14




################################################################
###################### ВЫЧИСЛЕНИЕ ФУНКЦИЙ ######################
################################################################

# Функция
echo("Имя:", '\t', FN, '\t', A, '\n')


# Функция













# nim c -d:release NimLibrary.nim

