
################################################################
##                    АРХИТЕКТУРА GPT
## 
##                    GPT architecture
## 
## Версия:   0.1
## Дата:     2026-06-23
## Автор:    github.com/Balans097
################################################################


# 0.1 — начальная реализация библиотеки




# nim c -d:release model.nim




import math, os, osproc, random, sequtils, strutils
import TextProcessing





################################################################
####################### ИСХОДНЫЕ ДАННЫЕ ########################
################################################################
const
    FN = "Файл.txt"

let
    A = 77

var
    s = 3.14




################################################################
###################### ВЫЧИСЛЕНИЕ ФУНКЦИЙ ######################
################################################################

# Функция
echo("Имя:", '\t', FN, '\t', A, '\n')


# Функция













# nim c -d:release model.nim

